https://www.hackerrank.com/challenges/the-company/problem

In [5]:
%load_ext sql

In [6]:
%sql mysql://root:root@localhost

In [10]:
%%sql 

drop schema q;
create schema q;
use q;

create table if not exists company (cc varchar(100), founder varchar(100));
create table if not exists lm (lm_code varchar(100), cc varchar(100));
create table if not exists sm (sm_code varchar(100), lm_code varchar(100), cc varchar(100));
create table if not exists m (m_code varchar(100), sm_code varchar(100), lm_code varchar(100), cc varchar(100));
create table if not exists e (e_code varchar(100), m_code varchar(100), sm_code varchar(100), lm_code varchar(100), cc varchar(100));

insert into company (cc, founder) values ('C1','Monika');
insert into company (cc, founder) values ('C2','Samantha');

insert into lm (lm_code, cc) values ('LM1','C1');
insert into lm (lm_code, cc) values ('LM2','C2');

insert into sm (sm_code, lm_code, cc) values ('SM1','LM1','C1');
insert into sm (sm_code, lm_code, cc) values ('SM2','LM1','C1');
insert into sm (sm_code, lm_code, cc) values ('SM3','LM2','C2');

insert into m (m_code, sm_code, lm_code, cc) values ('M1','SM1','LM1','C1');
insert into m (m_code, sm_code, lm_code, cc) values ('M2','SM3','LM2','C2');
insert into m (m_code, sm_code, lm_code, cc) values ('M3','SM3','LM2','C2');

insert into e (e_code, m_code, sm_code, lm_code, cc) values ('E1','M1','SM1','LM1','C1');
insert into e (e_code, m_code, sm_code, lm_code, cc) values ('E2','M1','SM1','LM1','C1');
insert into e (e_code, m_code, sm_code, lm_code, cc) values ('E3','M2','SM3','LM2','C2');
insert into e (e_code, m_code, sm_code, lm_code, cc) values ('E4','M3','SM3','LM2','C2');

 * mysql://root:***@localhost
0 rows affected.
1 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [21]:
%%time
%%sql

select  c.cc, c.founder, count(distinct lm.lm_code) as '#LM', count(distinct sm.sm_code) as '#SM',
count(distinct m.m_code) as '#M', count(distinct e.e_code) as '#E'
from company c
left join lm lm
on c.cc = lm.cc
left join sm sm
on lm.lm_code = sm.lm_code
left join m m
on sm.sm_code = m.sm_code
left join e e
on m.m_code = e.m_code
group by c.cc, c.founder
order by c.cc

 * mysql://root:***@localhost
2 rows affected.
Wall time: 5.61 ms

[('C1', 'Monika', 1, 2, 1, 2), ('C2', 'Samantha', 1, 1, 2, 2)]

In [20]:
%%time
%%sql

select C.cc, 
C.founder,
count(distinct L.lm_code),
count(distinct S.sm_code),
count(distinct M.m_code),
count(distinct E.e_code)
from company as C,
lm as L,
Sm as S,
M as M,
E as E 
WHERE E.m_code = M.m_code 
AND M.sm_code = S.sm_code
AND L.lm_code = S.lm_code
AND C.cc = L.cc
group by C.cc, C.founder
order by C.cc

 * mysql://root:***@localhost
2 rows affected.
Wall time: 8.72 ms

[('C1', 'Monika', 1, 1, 1, 2), ('C2', 'Samantha', 1, 1, 2, 2)]